Autodesk.Revit.DB.TableCellStyleOverrideOptions.SetAllOverrides(System.Boolean)
Sets all overrides to a specific value.
bOverride:
The value that will be assigned to all the overrides.
Since:
2014

Autodesk.Revit.DB.TableCellStyleOverrideOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.TableCellStyleOverrideOptions.BorderLineStyle
Indicates if the border line style characteristic is overridden.
Since:
2014

Autodesk.Revit.DB.TableCellStyleOverrideOptions.TextOrientation
Indicates if the text orientation characteristic is overridden.
Since:
2014

Autodesk.Revit.DB.TableCellStyleOverrideOptions.Underline
Indicates if the underline characteristic is overridden.
Since:
2014

Autodesk.Revit.DB.TableCellStyleOverrideOptions.Italics
Indicates if the italics characteristic is overridden.
Since:
2014

Autodesk.Revit.DB.TableCellStyleOverrideOptions.Bold
Indicates if the bold characteristic is overridden.
Since:
2014

Autodesk.Revit.DB.TableCellStyleOverrideOptions.VerticalAlignment
Indicates if the vertical alignment characteristic is overridden.
Since:
2014

Autodesk.Revit.DB.TableCellStyleOverrideOptions.HorizontalAlignment
Indicates if the horizontal alignment characteristic is overridden.
Since:
2014

Autodesk.Revit.DB.TableCellStyleOverrideOptions.BorderRightLineStyle
Indicates if the border right line style characteristic is overridden.
Since:
2014

Autodesk.Revit.DB.TableCellStyleOverrideOptions.BorderLeftLineStyle
Indicates if the border left line style characteristic is overridden.
Since:
2014

Autodesk.Revit.DB.TableCellStyleOverrideOptions.BorderBottomLineStyle
Indicates if the border bottom line style characteristic is overridden.
Since:
2014

Autodesk.Revit.DB.TableCellStyleOverrideOptions.BorderTopLineStyle
Indicates if the border top line style characteristic is overridden.
Since:
2014

Autodesk.Revit.DB.TableCellStyleOverrideOptions.BackgroundColor
Indicates if the background color characteristic is overridden.
Since:
2014

Autodesk.Revit.DB.TableCellStyleOverrideOptions.FontColor
Indicates if the font color characteristic is overridden.
Since:
2014

Autodesk.Revit.DB.TableCellStyleOverrideOptions.FontSize
Indicates if the font size characteristic is overridden.
Since:
2014

Autodesk.Revit.DB.TableCellStyleOverrideOptions.Font
Indicates if the font name characteristic is overridden.
Since:
2014

Autodesk.Revit.DB.TableCellStyleOverrideOptions.#ctor(Autodesk.Revit.DB.TableCellStyleOverrideOptions)
Creates a new instance by copying an existing instance.
other:
The instance to copy
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.TableCellStyleOverrideOptions.#ctor
Creates a new instance with no style characteristics overridden.
Since:
2014

Autodesk.Revit.DB.TableCellStyleOverrideOptions
This helper class represents the overridden characteristics of the associated cell.
Remarks:
The user can override the text appearance and cell graphic properties by setting the corresponding flag to true.
The global base format will control the non-overridden characteristics.
Since:
2014